/* No comment provided by engineer. */
"A destination (IP Address or Domain name) is needed to be able to subscribe" = "ต้องมีจุดปลายทาง (เลข IP address หรือชื่อ Domain) ในการส่งต่อข้อความแจ้งเดือน";

/* About prefs tab title */
"About" = "เกี่ยวกับ";

/* Title for section containing actions (SMS, MailMe, Speech, etc)
   Title to go on Actions pop up
   Title to go on the actions pop up */
"Actions" = "กิจกรรม";

/* Title to go above the actions pop up on */
"Actions:" = "กิจกรรม";

/* Option to add a compound action config */
"Add Compound" = "เพิ่มกิจกรรมผสม";

/* Button to add a configuration */
"Add Config" = "เพิ่มการตั้งค่า";

/* Button title for opening growl.info to downloads page */
"Additional Downloads" = "ดาวน์โหลดเพิ่มเติม";

/* No comment provided by engineer. */
"Alert! Enabling this option will add Growl.app to your login items" = "เตือน! ใช้ตัวเลือกนี้จะเพิ่ม Growl ในรายการเข้าสู้ระบบ";

/* Enable checkbox for allowing subscribers */
"Allow other computers to subscribe to all notifications" = "ยอมให้เครื่องคอมพิวเตอร์อื่นลงชื่อบอกรับการแจ้งเตือนทั้งหมด";

/* No comment provided by engineer. */
"Allowing this will let Growl launch everytime you login, so that it is available for applications which use it at all times" = "การยินยอมนี้จะทำให้ Growl เปิดเองเมื่อเข้าสู่ระบบ เพื่อให้แอพฯ ต่างๆ เข้าใช้ได้ตลอดเวลา";

/* Notification always stay on screen */
"Always" = "ตลอดเวลา";

/* No comment provided by engineer. */
"An uncorrectable error occured in creating or opening the Growl Tickets Database.\nApplications may register, and you can adjust settings.\nHowever, no registrations or settings will be saved to the next session, and Growl may use more memory" = "พบข้อผิดพลาดที่แก้ไขไม่ได้เมื่อสร้างหรือเปิดฐานข้อมูล\nแอพสามารถลงทะเบียนได้ และคุณสามารถแก้ไขการตั้งค่า\nแต่การลงทะเบียน และค่าที่ตั้งจะถูกเก็บบันทึกในรอบเซสชั่นหน้า และ Growl อาจใช้แรมมากกว่าปกติ";

/* No comment provided by engineer. */
"An uncorrectable error occured in creating or opening the History Database.\nWe are disabling History for the time being, however the rollup will continue to function.\nIf history is reenabled, nothing will be saved, and Growl will potentially use a lot of memory." = "ความผิดพลาดที่แก้ไขไม่ได้เกิดขึ้นเมื่อสร้างหรือเปิดฐานข้อมูลที่เก็บประวัติการแจ้งเตือน เราได้ปิดการใช้งานประวัติแจ้งเตือนสำหรับตอนนี้ แต่ Rollup จะทำงานปกติ\nเมื่อประวัติการแจ้งเตือนถูกเปิดใช้งานอีกครั้ง จะไม่มีข้อมูลอะไรที่ถูกบันทึก และ Growl ก็คงจะใช้หน่วยความจำมาก";

/* Column title for the applications column in the history table
   Label for the tab which contains application settings */
"Application" = "แอพพลิเคชั่น";

/* Application decides whether a note should stay on screen */
"Application Decides" = "ให้แอพพลิเคชั่นเลือก";

/* Use the application's defaults */
"Application Default" = "ค่าพื้นฐานของแอพ";

/* Label for application level display style choice */
"Application's Display Style" = "รูปแบบการแจ้งเตือนของแอพฯ";

/* No comment provided by engineer. */
"Application: %@\nTitle: %@\nDescription: %@\nClick to open the log" = "แอพพลิเคชั่น: %1$@\nหัวข้อ: %2$@\nคำอธิบาย: %3$@\nคลิกเพื่อเปิดบันทึก";

/* Application prefs tab title */
"Applications" = "แอพพลิเคชั่น";

/* No comment provided by engineer. */
"Are you sure you want to quit?" = "แน่ใจใช่ไหมว่าจะปิด?";

/* No comment provided by engineer. */
"Are you sure you want to remove %@?" = "แน่ใจใช่ไหมว่าต้องการลบ %@?";

/* No comment provided by engineer. */
"Bonjour configured entry, not presently findable" = "ช่องปรับแต่ง Bonjour ยังค้นหาไม่ได้ในตอนนี้";

/* Button title for canceling */
"Cancel" = "ยกเลิก";

/* Clear all history button title */
"Clear All History" = "ล้างประวัติทั้งหมด";

/* No comment provided by engineer. */
"Clear all notifications in the History Rollup" = "ล้างประวัติการแจ้งเตือนทั้งหมดใน Rollup";

/* No comment provided by engineer. */
"Clear Rollup" = "ล้าง Rollup";

/* close all open notifications */
"Close all notifications" = "ปิดข้อความแจ้งเตือนทั้งหมด";

/* Title for section containing compound actions (composed of multiple actions) */
"Compound" = "ผสม";

/* No comment provided by engineer. */
"Compound Action" = "กิจกรรมผสม";

/* Column title for a computer entry */
"Computer Name" = "ชื่อคอมพิวเตอร์";

/* Consider me idle based on time entered below */
"Consider me idle after:" = "ตั้งว่าอยู่ในสถานะ ไร้กิจกรรม หลังจาก";

/* Continue button title */
"Continue" = "ต่อไป";

/* we've detected a corrupt install in this currently running binary */
"Corrupt install detected" = "ตรวจพบว่า Growl ติดตั้งไม่สมบูรณ์";

/* Label for selectiong default actions */
"Default Actions" = "กิจกรรมพื้นฐาน";

/* Label for the global default starting position picker */
"Default starting position for notifications" = "ค่าเริ่มต้นของตำแหน่งแจ้งเตือน";

/* Default style picker label */
"Default Style" = "รูปแบบเริ่มต้น";

/* Explanation for what the big magic notification center switch means */
"Disable Growl visual controls and foward notifications to OS X" = "หยุดใช้การควบคุมการแสดงผลของ Growl และส่งข้อความแจ้งเตือนต่อไปยัง OS X";

/* alert when history database could not be moved aside */
"Disabling History" = "ปิดการใช้งานประวัติ";

/* Label for the display style of the selected notification */
"Display Style:" = "รูปแบบการแจ้งเตือน";

/* Column title for Display Styles */
"Display Styles" = "รูปแบบการแจ้งเตือน";

/* Display prefs tab title
   Title for section containing displays (Smoke, Whiteboard, Bezel, etc) */
"Displays" = "การแจ้งเตือน";

/* Continue button title when done */
"Done" = "เสร็จ";

/* Emergency notification priority */
"Emergency" = "ฉุกเฉิน";

/* Label for application on/off switch */
"Enable %@" = "เปิดใช้ %@";

/* Label for application on/off switch */
"Enable application" = "เปิดใช้แอพฯ";

/* Button label to allow growl to start at login */
"Enable Growl to run on Login" = "เปิด Growl เมื่อเข้าสู่ระบบ";

/* Label for the on/off switfh for enabling history */
"Enable History:" = "เปิดการใช้งานประวัติ";

/* Label for checkbox which enables logging for a note or application */
"Enable Logging" = "เปิดการใช้งานบันทึก";

/* No comment provided by engineer. */
"Enabling this option will cause Growl to run without showing a dock icon or a menu item.\n\nTo access preferences, tap Growl in Launchpad, or open Growl in Finder." = "เมื่อเปิดการใช้งานนี้ Growl จะทำงานแม้ไม่แสดงบน Dock หรือ Menu Bar\n\nคลิก Growl ใน Launchpad หรือ Finder เพื่อเข้าหน้าต่างการตั้งค่า";

/* Alert when database has been corrupted */
"Error opening %@." = "ข้อผิดพลาด เปิด %@ ไม่ได้";

/* fatal alert */
"Fatal Error" = "ข้อผิดพลาดร้ายแรง";

/* Info label for firewall settings */
"Firewall Settings: Network notifications use TCP port 23053" = "การตั้งค่าไฟวอล: การแจ้งเตือนบนเครือข่ายใช้พอร์ต 23053";

/* Enable checkbox for forwarding to other computers */
"Forward notifications to other computers" = "ส่งต่อข้อความแจ้งเตือนไปยังคอมฯ เครื่องอื่นๆ";

/* Tab title for forwarding */
"Forwarding" = "กำลังส่งต่อ";

/* General prefs tab title */
"General" = "ทั่วไป";

/* Label for button which will open to growl.info with information on applications and how to configure them */
"Get Applications" = "เรียกแอพฯ";

/* Button title which opens growl.info to the styles page */
"Get more styles" = "เรียกรูปแบบเพิ่ม";

/* Use the global defaults from the displays tab */
"Global Default" = "ค่าพื้นฐานหลัก";

/* Button to open http://growl.info/reportabug.php */
"Growl Bug Submission" = "แจ้งข้อบกพร่องของ Growl";

/* No comment provided by engineer. */
"Growl has encountered a fatal error trying to setup the %@, and will terminate upon closing this window.  Please contact us at support@growl.info." = "Growl พบข้อผิดพลาดร้ายแรงเมื่อเริ่มตั้งค่า %@ และจะต้องปิดตัวเองหลังจากหน้าต่างนี้ถูกปิด กรุณาติดต่อเราที่ support@growl.info";

/* No comment provided by engineer. */
"Growl History Disabled" = "การใช้ประวัติการแจ้งเตือนถูกปิด";

/* No comment provided by engineer. */
"Growl must restart for this change to take effect." = "ต้องปิด Growl แล้วเปิดใหม่ถึงจะใช้งานอันนี้ได้";

/* Window title for the Notification Rollup window */
"Growl Notification Rollup" = "Rollup การแจ้งเตือนของ Growl";

/* button to open http://growl.info */
"Growl Web Site" = "เว็บไซต์ Growl";

/* No comment provided by engineer. */
"Hide Rollup" = "ซ่อน Rollup";

/* No comment provided by engineer. */
"Hide the History Rollup" = "ซ่อนหน้าประวัติ Rollup";

/* High notification priority */
"High" = "สูง";

/* History prefs tab title */
"History" = "ประวัติ";

/* Unit of time for idle detection */
"Hours" = "ชั่วโมง";

/* Title on box containing idle detection controls */
"Idle Detection" = "ตรวจสอบสถานะ ไร้กิจกรรม";

/* No comment provided by engineer. */
"If you quit Growl you will no longer receive notifications." = "ถ้าคุณปิด Growl คุณจะไม่ได้รับการแจ้งเตือนต่อ";

/* Info label describing the bonjour icon's use */
"Indicates a discovered computer using Growl 1.3 or later" = "บ่งชี้ว่าพบคอมพิวเตอร์ที่ใช้ Growl เวอร์ชั่น 1.3 หรือสูงกว่า";

/* Info label describing the network icon's use */
"Indicates a manually entered computer to forward to or subscribe to" = "บ่งชี้ว่ามีคอมพิวเตอร์ที่ถูกเพิ่มในรายการรับข้อความส่งต่อ";

/* No comment provided by engineer. */
"Inform %@ when a notification is clicked" = "แจ้ง %@ เมื่อข้อความแจ้งเตือนถูกคลิก";

/* Label for checkbox for keeping up to an amount of notifications */
"Keep Amount" = "จำนวนที่เก็บ";

/* Label for checkbox for keeping up to a certain number of days worth of notifications */
"Keep Days" = "วันที่เก็บ";

/* Button label for removing old copies of growl */
"Legacy Growl Uninstaller" = "ลบ Growl เวอร์ชั่นเก่า";

/* Label for checkbox enabling incoming network notifications */
"Listen for incoming notifications" = "เปิดรับข้อความแจ้งเตือนจากภายนอก";

/* Title for section containing apps from the local machine */
"Local" = "ภายในเครื่อง";

/* Unit of time for idle detection */
"Minutes" = "นาที";

/* Moderate notification priority */
"Moderate" = "ปานกลาง";

/* Network prefs tab title */
"Network" = "เครือข่าย";

/* Notification will never stay on screen */
"Never" = "ไม่เคย";

/* No comment provided by engineer. */
"No" = "ไม่";

/* Use no actions */
"No Actions" = "ไม่มีกิจกรรม";

/* Don't do any actions */
"No Default Actions" = "ไม่มีกิจกรรมพื้นฐาน";

/* Setting for no visual display */
"No Default Display" = "ไม่มีการแสดงผลหลัก";

/* Growl will run compeletely in the background */
"No icon visible" = "ไม่มีไอคอนปรากฎ";

/* No comment provided by engineer. */
"No Recent Notifications" = "ไม่มีการแจ้งเตือนเร็วๆ นี้";

/* Normal notification priority */
"Normal" = "ปกติ";

/* Label for the tab which contains notification settings */
"Notifications" = "การแจ้งเตือน";

/* If the string is too long, use O */
"OFF" = "ปิด";

/* No comment provided by engineer. */
"OK" = "ตกลง";

/* No comment provided by engineer. */
"Ok" = "ตกลง";

/* If the string is too long, use I */
"ON" = "เปิด";

/* No comment provided by engineer. */
"Open Growl Preferences..." = "เปิดการตั้งค่า Growl..";

/* No comment provided by engineer. */
"Open the Growl preference pane" = "เปิดหน้าต่างตั้งค่าของ Growl";

/* Use Mac OS X Notifications switch label */
"OS X Notifications" = "การแจ้งเตือนของ OS X";

/* Column title for a password */
"Password" = "รหัสผ่าน";

/* No comment provided by engineer. */
"Pause Growl" = "หยุด Growl ชั่วคราว";

/* No comment provided by engineer. */
"Pause Growl visual notifications" = "หยุดการแจ้งเตือนชั่วคราว";

/* Localhost in a forwarding destination is not allowed */
"Please do not enter localhost, Growl does not support forwarding to itself." = "กรุณาอย่าใส่ localhost เพราะ Growl ไม่รองรับการส่งต่อมายังตัวเอง";

/* Localhost in a subscription destination is not allowed */
"Please do not enter localhost, Growl does not support subscribing to itself." = "กรุณาอย่าใส่ localhost เพราะ Growl ไม่รองรับการลงชื่อบอกรับจากตัวเอง";

/* A valid IP or domain is needed to forward to
   A valid IP or domain is needed to subscribe to */
"Please enter a valid IPv4 or IPv6 address, or a valid domain name" = "กรุณาใส่ IPv4 หรือ IPv6 หรือชื่อโดเมนที่ถูกต้อง";

/* No comment provided by engineer. */
"Plugin '%@' has been installed successfully. Do you want to configure it now?" = "ติดตั้งปลั๊กอิน '%@' เสร็จสมบูรณ์ คุณต้องการตั้งค่ามันตอนนี้หรือไม่?";

/* No comment provided by engineer. */
"Plugin '%@' is already installed, do you want to overwrite it?" = "ปลั๊กอิน '%@' ถูกติดตั้งอยู่แล้ว คุณต้องการลงทับหรือไม่?";

/* No comment provided by engineer. */
"Plugin '%@' will not work on this Mac running this version of Mac OS X. Install it anyway?" = "ปลั๊กอิน '%@' จะไม่ทำงานบน Mac OS X รุ่นนี้ ยังต้องการติดตั้งหรือไม่?";

/* No comment provided by engineer. */
"Plugin already exists" = "มีปลั๊กอิน '%@' อยู่แล้ว";

/* No comment provided by engineer. */
"Plugin installed" = "ติดตั้งปลั๊กอินแล้ว";

/* No comment provided by engineer. */
"Plugin missing native architecture" = "ปลั๊กอินไม่มีโครงสร้างแบบ native";

/* No comment provided by engineer. */
"Plugin not installed" = "ปลั๊กอินไม่ถูกติดตั้ง";

/* Preferences window title */
"Preferences" = "การตั้งค่า";

/* Button title which shows a preview of the current selected style
   Title of the Preview notification shown to demonstrate Growl displays */
"Preview" = "แสดงตัวอย่าง";

/* Label for choosing priority of the selected notification */
"Priority:" = "ความสำคัญ:";

/* Checkbox for whether the menu item should pulse */
"Pulse Menu Item" = "รายการเมนูเต้น";

/* No comment provided by engineer. */
"Quit" = "ปิด";

/* No comment provided by engineer. */
"Quit Growl entirely" = "ปิด Growl ทั้งหมด";

/* button for reading the instructions for fixing your install */
"Read Instructions and Quit" = "อ่านวิธีการใช้แล้วออกจากโปรแกรม";

/* Button title for removing something */
"Remove" = "ลบ";

/* No comment provided by engineer. */
"Resume Growl" = "ใช้ Growl ต่อ";

/* No comment provided by engineer. */
"Resume Growl visual notifications" = "ใช้การแจ้งเตือนบนหน้าจอต่อ";

/* Rollup prefs tab title */
"Rollup" = "Rollup";

/* Rollup all notifications radio button */
"Rollup all notes" = "Rollup บันทึกทั้งหมด";

/* Title for rollup automatic checkbox */
"Rollup Automatically Displays" = "Rollup แสดงอัตโนมัติ";

/* Title for rollup enabled checkbox */
"Rollup Enabled" = "Rollup เปิดใช้งาน";

/* Rollup only logged notifications radio button */
"Rollup only logged notes" = "Rollup เก็บบันทึกเท่านั้น";

/* History search field placeholder
   Placeholder text in search field */
"Search" = "ค้นหา";

/* Unit of time for idle detection */
"Seconds" = "วินาที";

/* Label for server password field */
"Server Password:" = "รหัสผ่านเซิฟเวอร์";

/* Button title which shows a list of disabled plugins */
"Show Disabled" = "การแสดงปิดใช้งาน";

/* Growl will have an icon in the menu and the dock */
"Show icon in both" = "แสดงไอคอนทั้งสองที่";

/* Growl will have an icon only in the dock */
"Show icon in the dock" = "แสดงไอคอนบน Dock";

/* Growl will have a menu bar icon only */
"Show icon in the menubar" = "แสดงไอคอนบน Menu Bar";

/* No comment provided by engineer. */
"Show Rollup" = "แสดง Rollup";

/* No comment provided by engineer. */
"Show the History Rollup" = "แสดงประวัติ Rollup";

/* Show hide keyboard shortcut */
"Show/Hide Shortcut" = "แสดง/ซ่อนคีย์ลัด";

/* Start Growl at Login switch label */
"Start Growl at Login" = "เปิด Growl เมื่อเข้าสู่ระบบ";

/* Label for choosing whether the selected note stays on screen */
"Stay On Screen:" = "อยู่บนจอตลอด";

/* Tab title for subscribers tab */
"Subscribers" = "ผู้ลงชื่อบอกรับ";

/* Tab title for subscriptions tab */
"Subscriptions" = "การลงชื่อบอกรับ";

/* No comment provided by engineer. */
"There are no new notifications" = "ไม่มีข้อความแจ้งเตือนใหม่";

/* No comment provided by engineer. */
"There was %lu notification while you were away" = "มี %lu ข้อความแจ้งเตือน เมื่อคุณไม่อยู่";

/* Error description format for subscription error returned display */
"There was an error subscribing to the remote machine:\ncode: %d\ndescription: %@" = "มีข้อผิดพลาดในการลงชื่อบอกรับจากเครื่องอื่น:\nเลขโค้ด: %1$d\nคำอธิบาย: %2$@";

/* No comment provided by engineer. */
"There was an error while installing the plugin '%@'." = "มีข้อผิดพลาดในการติดตั้งปลั๊กอิน '%@'";

/* No comment provided by engineer. */
"There was error opening the %@ file, it is possibly corrupted.\nGrowl will move the database aside, and create a fresh database.\nThis may have occured if Growl or the computer crashed." = "มีข้อผิดพลาดเมื่อเปิด %@ มันน่าจะเสียหาย\nGrowl จะย้ายฐานข้อมูลเดิมออกไป แล้วสร้างใหม่\nนี่น่าจะเกิดจากการที่ Growl หรือคอมพิวเตอร์ปิดเอง";

/* No comment provided by engineer. */
"There were %lu notifications while you were away" = "มี %lu ข้อความแจ้งเตือน เมื่อคุณไม่อยู่";

/* No comment provided by engineer. */
"This action cannot be undone, please confirm that you want to delete the entire notification history" = "นี่ไม่สามารถยกเลิกได้ภายหลัง กรุณายืนยันที่จะล้างประวัติการแจ้งเตือนทั้งหมด";

/* Preview message shown when clicking Preview in the system preferences pane. %@ becomes the name of the display style being used. */
"This is a preview of the %@ display" = "นี่คือตัวอย่างของรูปแบบ %@";

/* No comment provided by engineer. */
"This plugin configuration is in use, removing it will cause it to be removed from the applications and notifications where it is in use" = "ค่าปล๊ักอินนี้กำลังถูกใช้งาน ถ้าลบ จะเป็นการลบออกจากแอพ และข้อความแจ้งเตือนที่ใช้ด้วย";

/* No comment provided by engineer. */
"This should never happen! -(void)subscribe should only ever be called on local entries" = "สิ่งนี้ไม่ควรจะเกิดขึ้น -(void)subscribe ควรจะถูกใช้จากภายในเครื่องเท่านั้น";

/* No comment provided by engineer. */
"This will remove all Growl settings for %@." = "นี่จะลบการตั้งค่า Growl ในส่วน %@";

/* Column title for the time column in the history table */
"Time" = "เวลา";

/* Column title for the title column in the history table */
"Title" = "หัวข้อ";

/* No comment provided by engineer. */
"To prevent the history database from growing indefinitely, at least one type of automatic trim must be active" = "เพื่อป้องกันฐานข้อมูลประวัติโตแบบไม่สิ้นสุด อย่างน้อยต้องเปิดการ trim อัตโนมัติแบบใดแบบหนึ่งไว้";

/* No comment provided by engineer. */
"Turning off both automatic trim functions is not allowed." = "ปิด trim อัตโนมัติทั้งสองแบบไม่ได้";

/* Column title for whether to use the item on the row */
"Use" = "ใช้";

/* label for using a custom application wide starting position */
"Use custom starting position" = "ใช้ตำแหน่งที่กำหนดเอง";

/* label for using the global default starting position */
"Use default starting position" = "ใช้ตำแหน่งเริ่มต้น";

/* Column title for how long a subscriber is valid for */
"Valid until:" = "ใช้ได้ถึง:";

/* Very low notification priority */
"Very Low" = "ต่ำมาก";

/* No comment provided by engineer. */
"Warning! About to delete ALL history" = "คำเตือน! กำลังจะลบประวัติทั้งหมด";

/* alert that Growl will be limited to in memory for tickets */
"Warning! Application preferences will not be saved" = "คำเตือน! การตั้งค่าจะไม่ถูกบันทึกไว้";

/* No comment provided by engineer. */
"Warning! Enabling this option will cause Growl to run in the background" = "คำเตือน! เปิดใช้งานนี้จะทำให้ Growl ทำงานในเบื้องหลัง";

/* corrupt install alert */
"We've detected that the Mac App Store left you with a corrupt install.  Please follow the instructions the button takes you to in order to remedy the situation." = "เราตรวจพบว่า Mac App Store ติดตั้ง Growl ไม่สมบูรณ์ กรุณาทำตามวิธีต่อไปนี้เพื่อแก้ไขความผิดพลาด";

/* No comment provided by engineer. */
"Welcome to Growl!" = "ยินดีตอนรับสู่ Growl!";

/* Checkbox for idle detection based on locking the screen */
"When Screen is locked" = "เมื่อหน้าจอล็อค";

/* checkbox for idle detection based on screensaver */
"When Screensaver is active" = "เมื่อรูปพักหน้าจอแสดงอยู่";

/* No comment provided by engineer. */
"Yes" = "ใช่";

/* Label for the IP address list */
"You can connect manually at one of the following addresses:" = "คุณสามารถเริ่มการเชื่อมต่อไปยังคอมพิวเตอร์ที่มีเลข IP เหล่านี้เองได้";

